openFoam_fine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*|
  ========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  8
     \/     M anipulation  |
|*---------------------------------------------------------------------------*/
FoamFile
{
     version     2.0;
     format      ascii;
     class       dictionary;
     object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
vertices
(
	( 0.00000000  0.00000000  0.00000000 )  // 0
	( 7.17157288  0.00000000  0.00000000 )  // 1
	( 12.82842712  0.00000000  0.00000000 )  // 2
	( 30.00000000  0.00000000  0.00000000 )  // 3
	( 0.00000000  7.17157288  0.00000000 )  // 4
	( 7.17157288  7.17157288  0.00000000 )  // 5
	( 12.82842712  7.17157288  0.00000000 )  // 6
	( 30.00000000  7.17157288  0.00000000 )  // 7
	( 0.00000000  12.82842712  0.00000000 )  // 8
	( 7.17157288  12.82842712  0.00000000 )  // 9
	( 12.82842712  12.82842712  0.00000000 )  // 10
	( 30.00000000  12.82842712  0.00000000 )  // 11
	( 0.00000000  20.00000000  0.00000000 )  // 12
	( 7.17157288  20.00000000  0.00000000 )  // 13
	( 12.82842712  20.00000000  0.00000000 )  // 14
	( 30.00000000  20.00000000  0.00000000 )  // 15
	( 9.29289322  9.29289322  0.00000000 )  // 16
	( 10.70710678  9.29289322  0.00000000 )  // 17
	( 9.29289322  10.70710678  0.00000000 )  // 18
	( 10.70710678  10.70710678  0.00000000 )  // 19
	( 0.00000000  0.00000000  1.00000000 )  // 20
	( 7.17157288  0.00000000  1.00000000 )  // 21
	( 12.82842712  0.00000000  1.00000000 )  // 22
	( 30.00000000  0.00000000  1.00000000 )  // 23
	( 0.00000000  7.17157288  1.00000000 )  // 24
	( 7.17157288  7.17157288  1.00000000 )  // 25
	( 12.82842712  7.17157288  1.00000000 )  // 26
	( 30.00000000  7.17157288  1.00000000 )  // 27
	( 0.00000000  12.82842712  1.00000000 )  // 28
	( 7.17157288  12.82842712  1.00000000 )  // 29
	( 12.82842712  12.82842712  1.00000000 )  // 30
	( 30.00000000  12.82842712  1.00000000 )  // 31
	( 0.00000000  20.00000000  1.00000000 )  // 32
	( 7.17157288  20.00000000  1.00000000 )  // 33
	( 12.82842712  20.00000000  1.00000000 )  // 34
	( 30.00000000  20.00000000  1.00000000 )  // 35
	( 9.29289322  9.29289322  1.00000000 )  // 36
	( 10.70710678  9.29289322  1.00000000 )  // 37
	( 9.29289322  10.70710678  1.00000000 )  // 38
	( 10.70710678  10.70710678  1.00000000 )  // 39
);
blocks
(
	 hex (0 1 5 4 20 21 25 24) (20 20 1) simpleGrading (1 1 1)
	 hex (1 2 6 5 21 22 26 25) (40 20 1) simpleGrading (1 1 1)
	 hex (2 3 7 6 22 23 27 26) (150 20 1) simpleGrading (1 1 1)
	 hex (4  5  9  8  24 25 29 28) (20 40 1) simpleGrading (1 1 1)
	 hex (6  7  11 10 26 27 31 30) (150 40 1) simpleGrading (1 1 1)
	 hex (8  9  13 12 28 29 33 32) (20 20 1) simpleGrading (1 1 1)
	 hex (9  10 14 13 29 30 34 33) (40 20 1) simpleGrading (1 1 1)
	 hex (10 11 15 14 30 31 35 34) (150 20 1) simpleGrading (1 1 1)
	 hex (5  6  17 16 25 26 37 36) (40 50 1) simpleGrading (1.00000000 1 1)
	 hex (17 6  10 19 37 26 30 39) (50 40 1) simpleGrading (1.00000000 1 1)
	 hex (18 19 10 9  38 39 30 29) (40 50 1) simpleGrading (1 1.00000000 1)
	 hex (5  16 18 9  25 36 38 29) (50 40 1) simpleGrading (1 1.00000000 1)
);
edges
(
	 arc 5  6  (10.00000000 6.00000000 0)
	 arc 25 26 (10.00000000 6.00000000 1.00000000)
	 arc 5  9  (6.00000000 10.00000000  0)
	 arc 25 29 (6.00000000 10.00000000 1.00000000)
	 arc 6  10 (14.00000000 10.00000000 0)
	 arc 26 30 (14.00000000 10.00000000 1.00000000)
	 arc 9  10 (10.00000000 14.00000000 0)
	 arc 29 30 (10.00000000 14.00000000 1.00000000)
	 arc 16 17 (10.00000000 9.00000000 0)
	 arc 36 37 (10.00000000 9.00000000 1.00000000)
	 arc 17 19 (11.00000000 10.00000000 0)
	 arc 37 39 (11.00000000 10.00000000 1.00000000)
	 arc 18 19 (10.00000000 11.00000000 0)
	 arc 38 39 (10.00000000 11.00000000 1.00000000)
	 arc 16 18 (9.00000000 10.00000000 0)
	 arc 36 38 (9.00000000 10.00000000 1.00000000)
);
boundary
(
	inlet
	{
		type 	 patch;
		faces
		(
		(0 4 24 20)
		(4 8 24 28)
		(8 12 32 28)
		);
	}
	outlet
	{
		type patch;
		faces
		(
		(3 23 27 7)
		(7 27 31 11)
		(11 31 35 15)
		);
	}
	cylinder
	{
		type wall;
		faces
		(
		(17 19 39 37)
		(18 38 39 19)
		(16 36 38 18)
		(16 17 36 37)
		);
	}
	top
	{
		type symmetryPlane;
		faces
		(
		(12 32 33 13)
		(13 33 34 14)
		(14 34 35 15)
		);
	}
	bottom
	{
		type symmetryPlane;
		faces
		(
		(0 1 21 20)
		(1 2 22 21)
		(2 3 23 22)
		);
	}
	FrontAndBack
	{
		type empty;
		faces
		(
		(0 4 5 1)
		(1 5 6 2)
		(2 6 7 3)
		(4 8 9 5)
		(5 9 18 16)
		(5 16 17 6)
		(17 19 10 6)
		(18 9 10 19)
		(6 10 11 7)
		(8 12 13 9)
		(9 13 14 10)
		(10 14 15 11)
		(20 21 25 24)
		(21 22 26 25)
		(22 23 27 26)
		(24 25 29 28)
		(25 36 38 29)
		(25 26 37 36)
		(37 26 30 39)
		(38 39 30 29)
		(26 27 31 30)
		(28 29 32 33)
		(29 30 34 33)
		(30 31 35 34)
		);
	}
);
mergePatchPairs
();
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //