openFoam_fine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       46030;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       46110;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       46190;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          210;
        startFace       46350;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          210;
        startFace       46560;
    }
    FrontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          46400;
        startFace       46770;
    }
)

// ************************************************************************* //
