openFoam_fine/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.00153;

boundaryField
{
	inlet 
	{
		type 		fixedValue;
		value 		uniform 0.00153;
	}
	outlet
	{
		type 		zeroGradient;
	}
   	cylinder
    	{
        	type            epsilonWallFunction;
        	value           uniform 0.00153;
    	}
    	top
	{
		type 		symmetryPlane;
	}
	bottom
	{
		type 		symmetryPlane;
	}
	
	FrontAndBack
    	{
        	type            empty;
    	}
}


// ************************************************************************* //
