openFoam_fine/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.015;

boundaryField
{
	inlet
	{
		type 		fixedValue;
		value 		uniform 0.015;
	}
	outlet 
	{
		type 		zeroGradient;
	}
	cylinder
	{
		type 		fixedValue;
		value 		uniform 0.015;
	}
	top
	{
		type 		symmetryPlane;
	}
	bottom
	{
		type 		symmetryPlane;
	}
	

    	FrontAndBack
    	{
        	type            empty;
    	}
}


// ************************************************************************* //
