openFoam_fine/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    	inlet
    	{
        	type            calculated;
		value 		uniform 0;
    	}

    	outlet
    	{
        	type            zeroGradient;
    	}
	top
	{
		type 		symmetryPlane;
	}
	bottom
	{
		type 		symmetryPlane;
	}
    	cylinder 
    	{
          	type            nutkWallFunction;
		value 		uniform 0;
    	}
	

    	FrontAndBack
    	{
        	type            empty;
    	}
}

// ************************************************************************* //
