openFoam_fine/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
	inlet
	{
		type 		fixedValue;
		value 		uniform 10;
	}
	outlet
	{
		type 		zeroGradient;
	}
	cylinder
	{
		type 		fixedValue;
		value 		uniform 1;
	}
	top
	{
		type 		symmetryPlane;
	}
	bottom
	{
		type 		symmetryPlane;

	}
    

	FrontAndBack
    	{
        	type            empty;
    	}
}


// ************************************************************************* //
